performance/performance.yaml
#! /usr/local/bin/bzt
# execution:
# - hold-for: 1s
#   scenario: simple
  
# scenarios:
#   simple:
#     requests:
#      - http://blazedemo.com/
# reporting:
# - module: console
# - module: final-stats
#   summary: true  # overall samples count and percent of failures
#   percentiles: true  # display average times and percentiles
#   failed-labels: false  # provides list of sample labels with failures
#   test-duration: true  # provides test duration
#   dump-csv: perf_result_csv.csv

execution:
- iterations: 1 
  concurrency: 1
  scenario: with_script

scenarios:
  with_script:
    script: HTTPWord.jmx
    
reporting:
- module: final-stats
  dump-xml: stats.xml